# DividedpathBeginningIndent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedpathBeginningIndent Property
ParameterTypeId Class See Also
---
"Beginning Indent"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedpathBeginningIndent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedpathBeginningIndent As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedpathBeginningIndent {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace